{"config": [{"config": {"kernel_constraint": null, "unit_forget_bias": true, "name": "lstm_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 50, "unroll": false, "activation": "tanh", "bias_regularizer": null, "batch_input_shape": [null, 1, 8], "recurrent_dropout": 0.0, "go_backwards": false, "implementation": 1, "return_sequences": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "bias_constraint": null, "stateful": false, "dtype": "float32", "return_state": false, "dropout": 0.0, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "units": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential"}