{"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "implementation": 1, "dropout": 0.0, "kernel_regularizer": null, "return_state": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "trainable": true, "units": 100, "return_sequences": false, "stateful": false, "unroll": false, "batch_input_shape": [null, 2, 4], "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_1", "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "dtype": "float32"}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "trainable": true, "activation": "linear", "bias_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential"}