{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "name": "lstm_1", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "implementation": 1, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "unit_forget_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "activation": "tanh", "batch_input_shape": [null, 6, 2], "activity_regularizer": null, "return_state": false, "kernel_constraint": null, "dropout": 0.0, "use_bias": true, "units": 100, "return_sequences": false, "dtype": "float32", "unroll": false, "go_backwards": false}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "name": "dense_1", "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 1, "bias_regularizer": null}}], "keras_version": "2.1.2"}