{"keras_version": "2.1.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_state": false, "trainable": true, "recurrent_dropout": 0.0, "use_bias": true, "go_backwards": false, "kernel_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "recurrent_constraint": null, "name": "lstm_1", "bias_constraint": null, "activation": "tanh", "stateful": false, "unroll": false, "bias_regularizer": null, "batch_input_shape": [null, 4, 2], "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false, "recurrent_regularizer": null, "dtype": "float32", "activity_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "trainable": true, "activation": "linear", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "kernel_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}], "backend": "tensorflow"}