{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "units": 50, "go_backwards": false, "return_sequences": false, "implementation": 1, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_state": false, "recurrent_regularizer": null, "batch_input_shape": [null, 2, 4], "dtype": "float32", "kernel_regularizer": null, "stateful": false, "unroll": false, "recurrent_constraint": null, "unit_forget_bias": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "units": 1, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear"}}]}