{"config": [{"config": {"bias_regularizer": null, "units": 128, "kernel_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "dense_1", "use_bias": true, "batch_input_shape": [null, 11], "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 64, "kernel_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 1, "kernel_constraint": {"config": {}, "class_name": "NonNeg"}, "trainable": true, "activation": "linear", "kernel_regularizer": null, "name": "dense_3", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential"}